import { IVector3Like } from "../core/laya";

export const formation: Readonly<IVector3Like>[] = [
    // 第一排士兵
    { x: -0.6, y: 0, z: 0.2 },
    { x: -0.6, y: 0, z: -0.2 },
    { x: -0.6, y: 0, z: 0.6 },
    { x: -0.6, y: 0, z: -0.6 },
    // 第二排士兵
    { x: -1.2, y: 0, z: 0.2 },
    { x: -1.2, y: 0, z: -0.2 },
    { x: -1.2, y: 0, z: 0.6 },
    { x: -1.2, y: 0, z: -0.6 },
    // 第三排士兵
    { x: -1.8, y: 0, z: 0.2 },
    { x: -1.8, y: 0, z: -0.2 },
    { x: -1.8, y: 0, z: 0.6 },
    { x: -1.8, y: 0, z: -0.6 },
    // 三种资源车
    // { x: -2.6, y: 0, z: 0.6 },
    // { x: -2.6, y: 0, z: 0 },
    // { x: -2.6, y: 0, z: -0.6 },
    { x: -2.6, y: 0, z: 0.4 },
    { x: -2.6, y: 0, z: -0.4 },
];
